spec/fixtures/requests/order_service/get_order_list/with_join_dates.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsdl="http://api.channeladvisor.com/webservices/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://api.channeladvisor.com/webservices/" xmlns:ins1="http://api.channeladvisor.com/datacontracts/orders"><env:Header><ins0:APICredentials><ins0:DeveloperKey>$$DEVELOPER_KEY$$</ins0:DeveloperKey><ins0:Password>$$PASSWORD$$</ins0:Password></ins0:APICredentials></env:Header><env:Body><ins0:GetOrderList><ins0:accountID>$$ACCOUNT_ID$$</ins0:accountID><ins0:orderCriteria><ins1:OrderCreationFilterBeginTimeGMT>2012-05-14T00:00:00+00:00</ins1:OrderCreationFilterBeginTimeGMT><ins1:OrderCreationFilterEndTimeGMT>2012-05-15T00:00:00+00:00</ins1:OrderCreationFilterEndTimeGMT><ins1:StatusUpdateFilterBeginTimeGMT>2012-05-14T00:00:00+00:00</ins1:StatusUpdateFilterBeginTimeGMT><ins1:StatusUpdateFilterEndTimeGMT>2012-05-15T00:00:00+00:00</ins1:StatusUpdateFilterEndTimeGMT><ins1:JoinDateFiltersWithOr>true</ins1:JoinDateFiltersWithOr><ins1:PageNumberFilter xsi:nil="true"/><ins1:PageSize xsi:nil="true"/></ins0:orderCriteria></ins0:GetOrderList></env:Body></env:Envelope>